# Завдання 1. Оптимізація виробництва

# Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік". 
# Для виробництва цих напоїв використовуються різні інгредієнти та обмежена кількість обладнання. 
# Задача полягає у максимізації виробництва, враховуючи обмежені ресурси.

# Умови завдання:

# "Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
# "Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".
# Обмеження ресурсів: 100 од. "Води", 50 од. "Цукру", 30 од. "Лимонного соку" та 40 од. "Фруктового пюре".
# Виробництво одиниці "Лимонаду" вимагає 2 од. "Води", 1 од. "Цукру" та 1 од. "Лимонного соку".
# Виробництво одиниці "Фруктового соку" вимагає 2 од. "Фруктового пюре" та 1 од. "Води".
# Використовуючи PuLP, створіть модель, яка визначає, скільки "Лимонаду" та "Фруктового соку" 
# потрібно виробити для максимізації загальної кількості продуктів, дотримуючись обмежень на ресурси. 
# Напишіть програму, код якої максимізує загальну кількість вироблених продуктів "Лимонад" та "Фруктовий сік", 
# враховуючи обмеження на кількість ресурсів.

import pulp

def main():
    model = pulp.LpProblem("Max_Amount", pulp.LpMaximize)
    x1 = pulp.LpVariable('x1', lowBound=0, cat='Integer') # лимонад
    x2 = pulp.LpVariable('x2', lowBound=0, cat='Integer') # фруктовий сік
    model += x1 + x2, "Problem"

    model += 2*x1 + x2 <= 100, "Constraint_Water"
    model += x1 <= 50, "Constraint_Sugar"
    model += x1 <= 30, "Constraint_Juice"
    model += 2*x2 <= 40, "Constraint_Fruit_Puree"

    model.solve()
    pulp.LpStatus[model.status]

    for variable in model.variables():
        print(f"{variable.name} = {variable.varValue}")

    # Вартість цільової функції
    print(f"Total cost = {pulp.value(model.objective)}")


if __name__ == "__main__":
    main()